Revit 2027 API
PDFExportOptions.StopOnError Property
 Whether export process should stop when a view fails to export
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool StopOnError { get; set; }
Public Property StopOnError As Boolean
	Get
	Set
public:
property bool StopOnError {
	bool get ();
	void set (bool value);
}
member StopOnError : bool with get, set
Property Value
Boolean
See Also
Reference
PDFExportOptions Class
Autodesk.Revit.DB Namespace